RT-Thread/rt-thread/bsp/nxp/lpc/lpc408x/Libraries/Drivers/include/lpc_can.h
/**********************************************************************
* $Id$      lpc_can.h           2011-06-02
*//**
* @file     lpc_can.h
* @brief    Contains all macro definitions and function prototypes
*           support for CAN firmware library on LPC
* @version  1.0
* @date     02. June. 2011
* @author   NXP MCU SW Application Team
* 
* Copyright(C) 2011, NXP Semiconductor
* All rights reserved.
*
***********************************************************************
* Software that is described herein is for illustrative purposes only
* which provides customers with programming information regarding the
* products. This software is supplied "AS IS" without any warranties.
* NXP Semiconductors assumes no responsibility or liability for the
* use of the software, conveys no license or title under any patent,
* copyright, or mask work right to the product. NXP Semiconductors
* reserves the right to make changes in the software without
* notification. NXP Semiconductors also make no representation or
* warranty that such application will be suitable for the specified
* use without further testing or modification.
* Permission to use, copy, modify, and distribute this software and its
* documentation is hereby granted, under NXP Semiconductors'
* relevant copyright in the software, without fee, provided that it
* is used in conjunction with NXP Semiconductors microcontrollers.  This
* copyright, permission, and disclaimer notice must appear in all copies of
* this code.
**********************************************************************/

/* Peripheral group ----------------------------------------------------------- */
/** @defgroup CAN CAN (Controller Area Network)
 * @ingroup LPC_CMSIS_FwLib_Drivers
 * @{
 */

#ifndef __LPC_CAN_H_
#define __LPC_CAN_H_

/* Includes ------------------------------------------------------------------- */
#include "LPC407x_8x_177x_8x.h"

#include "lpc_types.h"

#ifdef __cplusplus
extern "C"
{
#endif

/* Public Types --------------------------------------------------------------- */
/** @defgroup CAN_Public_Macros CAN Public Macros
 * @{
 */

/** Controller ID for CAN1 */
#define CAN1_CTRL               ((uint8_t)(0))

/** Controller ID for CAN2 */
#define CAN2_CTRL               ((uint8_t)(1))

/** Message(s) Acceptance is enabled */
#define MSG_ENABLE              ((uint8_t)(0))

/** Message(s) Acceptance is disabled */
#define MSG_DISABLE             ((uint8_t)(1))


/**
 * @}
 */

/* Private Macros ------------------------------------------------------------- */
/** @defgroup CAN_Private_Macros CAN Private Macros
 * @{
 */

/* --------------------- BIT DEFINITIONS -------------------------------------- */
/*********************************************************************//**
 * Macro defines for CAN Mode Register
 **********************************************************************/
/** CAN Reset mode */
#define CAN_MOD_RM          ((uint32_t)(1<<0))

/** CAN Listen Only Mode */
#define CAN_MOD_LOM         ((uint32_t)(1<<1))

/** CAN Self Test mode */
#define CAN_MOD_STM         ((uint32_t)(1<<2))

/** CAN Transmit Priority mode */
#define CAN_MOD_TPM         ((uint32_t)(1<<3))

/** CAN Sleep mode */
#define CAN_MOD_SM          ((uint32_t)(1<<4))

/** CAN Receive Polarity mode */
#define CAN_MOD_RPM         ((uint32_t)(1<<5))

/** CAN Test mode */
#define CAN_MOD_TM          ((uint32_t)(1<<7))

/*********************************************************************//**
 * Macro defines for CAN Command Register
 **********************************************************************/
/** CAN Transmission Request */
#define CAN_CMR_TR          ((uint32_t)(1))

/** CAN Abort Transmission */
#define CAN_CMR_AT          ((uint32_t)(1<<1))

/** CAN Release Receive Buffer */
#define CAN_CMR_RRB         ((uint32_t)(1<<2))

/** CAN Clear Data Overrun */
#define CAN_CMR_CDO         ((uint32_t)(1<<3))

/** CAN Self Reception Request */
#define CAN_CMR_SRR         ((uint32_t)(1<<4))

/** CAN Select Tx Buffer 1 */
#define CAN_CMR_STB1        ((uint32_t)(1<<5))

/** CAN Select Tx Buffer 2 */
#define CAN_CMR_STB2        ((uint32_t)(1<<6))

/** CAN Select Tx Buffer 3 */
#define CAN_CMR_STB3        ((uint32_t)(1<<7))

/*********************************************************************//**
 * Macro defines for CAN Global Status Register
 **********************************************************************/
/** CAN Receive Buffer Status */
#define CAN_GSR_RBS         ((uint32_t)(1))

/** CAN Data Overrun Status */
#define CAN_GSR_DOS         ((uint32_t)(1<<1))

/** CAN Transmit Buffer Status */
#define CAN_GSR_TBS         ((uint32_t)(1<<2))

/** CAN Transmit Complete Status */
#define CAN_GSR_TCS         ((uint32_t)(1<<3))

/** CAN Receive Status */
#define CAN_GSR_RS          ((uint32_t)(1<<4))

/** CAN Transmit Status */
#define CAN_GSR_TS          ((uint32_t)(1<<5))

/** CAN Error Status */
#define CAN_GSR_ES          ((uint32_t)(1<<6))

/** CAN Bus Status */
#define CAN_GSR_BS          ((uint32_t)(1<<7))

/** CAN Current value of the Rx Error Counter */
#define CAN_GSR_RXERR(n)    ((uint32_t)((n&0xFF)<<16))

/** CAN Current value of the Tx Error Counter */
#define CAN_GSR_TXERR(n)    ((uint32_t)(n&0xFF)<<24))

/*********************************************************************//**
 * Macro defines for CAN Interrupt and Capture Register
 **********************************************************************/
/** CAN Receive Interrupt */
#define CAN_ICR_RI          ((uint32_t)(1))

/** CAN Transmit Interrupt 1 */
#define CAN_ICR_TI1         ((uint32_t)(1<<1))

/** CAN Error Warning Interrupt */
#define CAN_ICR_EI          ((uint32_t)(1<<2))

/** CAN Data Overrun Interrupt */
#define CAN_ICR_DOI         ((uint32_t)(1<<3))

/** CAN Wake-Up Interrupt */
#define CAN_ICR_WUI         ((uint32_t)(1<<4))

/** CAN Error Passive Interrupt */
#define CAN_ICR_EPI         ((uint32_t)(1<<5))

/** CAN Arbitration Lost Interrupt */
#define CAN_ICR_ALI         ((uint32_t)(1<<6))

/** CAN Bus Error Interrupt */
#define CAN_ICR_BEI         ((uint32_t)(1<<7))

/** CAN ID Ready Interrupt */
#define CAN_ICR_IDI         ((uint32_t)(1<<8))

/** CAN Transmit Interrupt 2 */
#define CAN_ICR_TI2         ((uint32_t)(1<<9))

