RT-Thread/rt-thread/bsp/nxp/lpc/lpc408x/Libraries/Drivers/include/lpc_can.h
/** CAN Transmit Interrupt 3 */
#define CAN_ICR_TI3         ((uint32_t)(1<<10))

/** CAN Error Code Capture */
#define CAN_ICR_ERRBIT(n)   ((uint32_t)((n&0x1F)<<16))

/** CAN Error Direction */
#define CAN_ICR_ERRDIR      ((uint32_t)(1<<21))

/** CAN Error Capture */
#define CAN_ICR_ERRC(n)     ((uint32_t)((n&0x3)<<22))

/** CAN Arbitration Lost Capture */
#define CAN_ICR_ALCBIT(n)       ((uint32_t)((n&0xFF)<<24))

/*********************************************************************//**
 * Macro defines for CAN Interrupt Enable Register
 **********************************************************************/
/** CAN Receive Interrupt Enable */
#define CAN_IER_RIE         ((uint32_t)(1))

/** CAN Transmit Interrupt Enable for buffer 1 */
#define CAN_IER_TIE1        ((uint32_t)(1<<1))

/** CAN Error Warning Interrupt Enable */
#define CAN_IER_EIE         ((uint32_t)(1<<2))

/** CAN Data Overrun Interrupt Enable */
#define CAN_IER_DOIE        ((uint32_t)(1<<3))

/** CAN Wake-Up Interrupt Enable */
#define CAN_IER_WUIE        ((uint32_t)(1<<4))

/** CAN Error Passive Interrupt Enable */
#define CAN_IER_EPIE        ((uint32_t)(1<<5))

/** CAN Arbitration Lost Interrupt Enable */
#define CAN_IER_ALIE        ((uint32_t)(1<<6))

/** CAN Bus Error Interrupt Enable */
#define CAN_IER_BEIE        ((uint32_t)(1<<7))

/** CAN ID Ready Interrupt Enable */
#define CAN_IER_IDIE        ((uint32_t)(1<<8))

/** CAN Transmit Enable Interrupt for Buffer 2 */
#define CAN_IER_TIE2        ((uint32_t)(1<<9))

/** CAN Transmit Enable Interrupt for Buffer 3 */
#define CAN_IER_TIE3        ((uint32_t)(1<<10))

/*********************************************************************//**
 * Macro defines for CAN Bus Timing Register
 **********************************************************************/
/** CAN Baudrate Prescaler */
#define CAN_BTR_BRP(n)      ((uint32_t)(n&0x3FF))

/** CAN Synchronization Jump Width */
#define CAN_BTR_SJM(n)      ((uint32_t)((n&0x3)<<14))

/** CAN Time Segment 1 */
#define CAN_BTR_TESG1(n)    ((uint32_t)(n&0xF)<<16))

/** CAN Time Segment 2 */
#define CAN_BTR_TESG2(n)    ((uint32_t)(n&0xF)<<20))

/** CAN Sampling */
#define CAN_BTR_SAM(n)      ((uint32_t)(1<<23))

/*********************************************************************//**
 * Macro defines for CAN Error Warning Limit Register
 **********************************************************************/
/** CAN Error Warning Limit */
#define CAN_EWL_EWL(n)      ((uint32_t)(n&0xFF))

/*********************************************************************//**
 * Macro defines for CAN Status Register
 **********************************************************************/
/** CAN Receive Buffer Status */
#define CAN_SR_RBS      ((uint32_t)(1))

/** CAN Data Overrun Status */
#define CAN_SR_DOS      ((uint32_t)(1<<1))

/** CAN Transmit Buffer Status 1 */
#define CAN_SR_TBS1     ((uint32_t)(1<<2))

/** CAN Transmission Complete Status of Buffer 1 */
#define CAN_SR_TCS1     ((uint32_t)(1<<3))

/** CAN Receive Status */
#define CAN_SR_RS       ((uint32_t)(1<<4))

/** CAN Transmit Status 1 */
#define CAN_SR_TS1      ((uint32_t)(1<<5))

/** CAN Error Status */
#define CAN_SR_ES       ((uint32_t)(1<<6))

/** CAN Bus Status */
#define CAN_SR_BS       ((uint32_t)(1<<7))

/** CAN Transmit Buffer Status 2 */
#define CAN_SR_TBS2     ((uint32_t)(1<<10))

/** CAN Transmission Complete Status of Buffer 2 */
#define CAN_SR_TCS2     ((uint32_t)(1<<11))

/** CAN Transmit Status 2 */
#define CAN_SR_TS2      ((uint32_t)(1<<13))

/** CAN Transmit Buffer Status 2 */
#define CAN_SR_TBS3     ((uint32_t)(1<<18))

/** CAN Transmission Complete Status of Buffer 2 */
#define CAN_SR_TCS3     ((uint32_t)(1<<19))

/** CAN Transmit Status 2 */
#define CAN_SR_TS3      ((uint32_t)(1<<21))

/*********************************************************************//**
 * Macro defines for CAN Receive Frame Status Register
 **********************************************************************/
/** CAN ID Index */
#define CAN_RFS_ID_INDEX(n) ((uint32_t)(n&0x3FF))

/** CAN Bypass */
#define CAN_RFS_BP          ((uint32_t)(1<<10))

/** CAN Data Length Code */
#define CAN_RFS_DLC(n)      ((uint32_t)((n&0xF)<<16)

/** CAN Remote Transmission Request */
#define CAN_RFS_RTR         ((uint32_t)(1<<30))

/** CAN control 11 bit or 29 bit Identifier */
#define CAN_RFS_FF          ((uint32_t)(1<<31))

/*********************************************************************//**
 * Macro defines for CAN Receive Identifier Register
 **********************************************************************/
/** CAN 11 bit Identifier */
#define CAN_RID_ID_11(n)        ((uint32_t)(n&0x7FF))

/** CAN 29 bit Identifier */
#define CAN_RID_ID_29(n)        ((uint32_t)(n&0x1FFFFFFF))

/*********************************************************************//**
 * Macro defines for CAN Receive Data A Register
 **********************************************************************/
/** CAN Receive Data 1 */
#define CAN_RDA_DATA1(n)        ((uint32_t)(n&0xFF))

/** CAN Receive Data 2 */
#define CAN_RDA_DATA2(n)        ((uint32_t)((n&0xFF)<<8))

/** CAN Receive Data 3 */
#define CAN_RDA_DATA3(n)        ((uint32_t)((n&0xFF)<<16))

/** CAN Receive Data 4 */
#define CAN_RDA_DATA4(n)        ((uint32_t)((n&0xFF)<<24))

/*********************************************************************//**
 * Macro defines for CAN Receive Data B Register
 **********************************************************************/
/** CAN Receive Data 5 */
#define CAN_RDB_DATA5(n)        ((uint32_t)(n&0xFF))

/** CAN Receive Data 6 */
#define CAN_RDB_DATA6(n)        ((uint32_t)((n&0xFF)<<8))

/** CAN Receive Data 7 */
#define CAN_RDB_DATA7(n)        ((uint32_t)((n&0xFF)<<16))

/** CAN Receive Data 8 */
#define CAN_RDB_DATA8(n)        ((uint32_t)((n&0xFF)<<24))

/*********************************************************************//**
 * Macro defines for CAN Transmit Frame Information Register
 **********************************************************************/
/** CAN Priority */
#define CAN_TFI_PRIO(n)         ((uint32_t)(n&0xFF))

/** CAN Data Length Code */
#define CAN_TFI_DLC(n)          ((uint32_t)((n&0xF)<<16))

/** CAN Remote Frame Transmission */
#define CAN_TFI_RTR             ((uint32_t)(1<<30))

/** CAN control 11-bit or 29-bit Identifier */
#define CAN_TFI_FF              ((uint32_t)(1<<31))

/*********************************************************************//**
 * Macro defines for CAN Transmit Identifier Register
 **********************************************************************/
/** CAN 11-bit Identifier */
#define CAN_TID_ID11(n)         ((uint32_t)(n&0x7FF))

