RT-Thread/rt-thread/bsp/nxp/lpc/lpc408x/Libraries/Drivers/include/lpc_can.h
/** CAN 11-bit Identifier */
#define CAN_TID_ID29(n)         ((uint32_t)(n&0x1FFFFFFF))

/*********************************************************************//**
 * Macro defines for CAN Transmit Data A Register
 **********************************************************************/
/** CAN Transmit Data 1 */
#define CAN_TDA_DATA1(n)        ((uint32_t)(n&0xFF))

/** CAN Transmit Data 2 */
#define CAN_TDA_DATA2(n)        ((uint32_t)((n&0xFF)<<8))

/** CAN Transmit Data 3 */
#define CAN_TDA_DATA3(n)        ((uint32_t)((n&0xFF)<<16))

/** CAN Transmit Data 4 */
#define CAN_TDA_DATA4(n)        ((uint32_t)((n&0xFF)<<24))

/*********************************************************************//**
 * Macro defines for CAN Transmit Data B Register
 **********************************************************************/
/** CAN Transmit Data 5 */
#define CAN_TDA_DATA5(n)        ((uint32_t)(n&0xFF))

/** CAN Transmit Data 6 */
#define CAN_TDA_DATA6(n)        ((uint32_t)((n&0xFF)<<8))

/** CAN Transmit Data 7 */
#define CAN_TDA_DATA7(n)        ((uint32_t)((n&0xFF)<<16))

/** CAN Transmit Data 8 */
#define CAN_TDA_DATA8(n)        ((uint32_t)((n&0xFF)<<24))

/*********************************************************************//**
 * Macro defines for CAN Sleep Clear Register
 **********************************************************************/
/** CAN1 Sleep mode */
#define CAN1SLEEPCLR            ((uint32_t)(1<<1))

/** CAN2 Sleep Mode */
#define CAN2SLEEPCLR            ((uint32_t)(1<<2))

/*********************************************************************//**
 * Macro defines for CAN Wake up Flags Register
 **********************************************************************/
/** CAN1 Sleep mode */
#define CAN_WAKEFLAGES_CAN1WAKE     ((uint32_t)(1<<1))

/** CAN2 Sleep Mode */
#define CAN_WAKEFLAGES_CAN2WAKE     ((uint32_t)(1<<2))

/*********************************************************************//**
 * Macro defines for Central transmit Status Register
 **********************************************************************/
/** CAN Transmit 1 */
#define CAN_TSR_TS1         ((uint32_t)(1))

/** CAN Transmit 2 */
#define CAN_TSR_TS2         ((uint32_t)(1<<1))

/** CAN Transmit Buffer Status 1 */
#define CAN_TSR_TBS1            ((uint32_t)(1<<8))

/** CAN Transmit Buffer Status 2 */
#define CAN_TSR_TBS2            ((uint32_t)(1<<9))

/** CAN Transmission Complete Status 1 */
#define CAN_TSR_TCS1            ((uint32_t)(1<<16))

/** CAN Transmission Complete Status 2 */
#define CAN_TSR_TCS2            ((uint32_t)(1<<17))

/*********************************************************************//**
 * Macro defines for Central Receive Status Register
 **********************************************************************/
/** CAN Receive Status 1 */
#define CAN_RSR_RS1             ((uint32_t)(1))

/** CAN Receive Status 1 */
#define CAN_RSR_RS2             ((uint32_t)(1<<1))

/** CAN Receive Buffer Status 1*/
#define CAN_RSR_RB1             ((uint32_t)(1<<8))

/** CAN Receive Buffer Status 2*/
#define CAN_RSR_RB2             ((uint32_t)(1<<9))

/** CAN Data Overrun Status 1 */
#define CAN_RSR_DOS1            ((uint32_t)(1<<16))

/** CAN Data Overrun Status 1 */
#define CAN_RSR_DOS2            ((uint32_t)(1<<17))

/*********************************************************************//**
 * Macro defines for Central Miscellaneous Status Register
 **********************************************************************/
/** Same CAN Error Status in CAN1GSR */
#define CAN_MSR_E1      ((uint32_t)(1))

/** Same CAN Error Status in CAN2GSR */
#define CAN_MSR_E2      ((uint32_t)(1<<1))

/** Same CAN Bus Status in CAN1GSR */
#define CAN_MSR_BS1     ((uint32_t)(1<<8))

/** Same CAN Bus Status in CAN2GSR */
#define CAN_MSR_BS2     ((uint32_t)(1<<9))

/*********************************************************************//**
 * Macro defines for Acceptance Filter Mode Register
 **********************************************************************/
/** CAN Acceptance Filter Off mode */
#define CAN_AFMR_AccOff     ((uint32_t)(1))

/** CAN Acceptance File Bypass mode */
#define CAN_AFMR_AccBP      ((uint32_t)(1<<1))

/** FullCAN Mode Enhancements */
#define CAN_AFMR_eFCAN      ((uint32_t)(1<<2))

/*********************************************************************//**
 * Macro defines for Standard Frame Individual Start Address Register
 **********************************************************************/
/** The start address of the table of individual Standard Identifier */
#define CAN_STT_sa(n)       ((uint32_t)((n&1FF)<<2))

/*********************************************************************//**
 * Macro defines for Standard Frame Group Start Address Register
 **********************************************************************/
/** The start address of the table of grouped Standard Identifier */
#define CAN_SFF_GRP_sa(n)       ((uint32_t)((n&3FF)<<2))

/*********************************************************************//**
 * Macro defines for Extended Frame Start Address Register
 **********************************************************************/
/** The start address of the table of individual Extended Identifier */
#define CAN_EFF_sa(n)       ((uint32_t)((n&1FF)<<2))

/*********************************************************************//**
 * Macro defines for Extended Frame Group Start Address Register
 **********************************************************************/
/** The start address of the table of grouped Extended Identifier */
#define CAN_Eff_GRP_sa(n)       ((uint32_t)((n&3FF)<<2))

/*********************************************************************//**
 * Macro defines for End Of AF Table Register
 **********************************************************************/
/** The End of Table of AF LookUp Table */
#define CAN_EndofTable(n)       ((uint32_t)((n&3FF)<<2))

/*********************************************************************//**
 * Macro defines for LUT Error Address Register
 **********************************************************************/
/** CAN Look-Up Table Error Address */
#define CAN_LUTerrAd(n)     ((uint32_t)((n&1FF)<<2))

/*********************************************************************//**
 * Macro defines for LUT Error Register
 **********************************************************************/
/** CAN Look-Up Table Error */
#define CAN_LUTerr      ((uint32_t)(1))

/*********************************************************************//**
 * Macro defines for Global FullCANInterrupt Enable Register
 **********************************************************************/
/** Global FullCANInterrupt Enable */
#define CAN_FCANIE      ((uint32_t)(1))

/*********************************************************************//**
 * Macro defines for FullCAN Interrupt and Capture Register 0
 **********************************************************************/
/** FullCAN Interrupt and Capture (0-31)*/
#define CAN_FCANIC0_IntPnd(n)   ((uint32_t)(1<<n))

/*********************************************************************//**
 * Macro defines for FullCAN Interrupt and Capture Register 1
 **********************************************************************/
/** FullCAN Interrupt and Capture (0-31)*/
#define CAN_FCANIC1_IntPnd(n)   ((uint32_t)(1<<(n-32)))


/* ---------------- CHECK PARAMETER DEFINITIONS ---------------------------- */
/** Macro to determine if it is valid CAN peripheral or not */
#define PARAM_CANx(x)           ((((uint32_t*)x)==((uint32_t *)LPC_CAN1)) \
                                        ||(((uint32_t*)x)==((uint32_t *)LPC_CAN2)))

/*  Macro to determine if it is valid CANAF or not*/
#define PARAM_CANAFx(x)         (((uint32_t*)x)== ((uint32_t*)LPC_CANAF))

