RT-Thread/rt-thread/bsp/nxp/lpc/lpc408x/Libraries/Drivers/include/lpc_can.h
/*  Macro to determine if it is valid CANAF RAM or not*/
#define PARAM_CANAFRAMx(x)      (((uint32_t*)x)== (uint32_t*)LPC_CANAF_RAM)

/*  Macro to determine if it is valid CANCR or not*/
#define PARAM_CANCRx(x)         (((uint32_t*)x)==((uint32_t*)LPC_CANCR))

/** Macro to check Data to send valid */
#define PARAM_I2S_DATA(data)    ((data>=0)&&(data <= 0xFFFFFFFF))

/** Macro to check frequency value */
#define PRAM_I2S_FREQ(freq)     ((freq>=16000)&&(freq <= 96000))

/** Macro to check Frame Identifier */
#define PARAM_ID_11(n)          ((n>>11)==0) /*-- 11 bit --*/
#define PARAM_ID_29(n)          ((n>>29)==0) /*-- 29 bit --*/

/** Macro to check DLC value */
#define PARAM_DLC(n)            ((n>>4)==0)  /*-- 4 bit --*/

/** Macro to check ID format type */
#define PARAM_ID_FORMAT(n)      ((n==STD_ID_FORMAT)||(n==EXT_ID_FORMAT))

/** Macro to check Group identifier */
#define PARAM_GRP_ID(x, y)      ((x<=y))

/** Macro to check Frame type */
#define PARAM_FRAME_TYPE(n)     ((n==DATA_FRAME)||(n==REMOTE_FRAME))

/** Macro to check Control/Central Status type parameter */
#define PARAM_CTRL_STS_TYPE(n)  ((n==CANCTRL_GLOBAL_STS)||(n==CANCTRL_INT_CAP) \
                                            ||(n==CANCTRL_ERR_WRN)||(n==CANCTRL_STS))

/** Macro to check CR status type */
#define PARAM_CR_STS_TYPE(n)    ((n==CANCR_TX_STS)||(n==CANCR_RX_STS) \
                                                            ||(n==CANCR_MS))

/** Macro to check AF Mode type parameter */
#define PARAM_AFMODE_TYPE(n)    ((n==CAN_NORMAL)||(n==CAN_ACC_OFF) \
                                            ||(n==CAN_ACC_BP)||(n==CAN_EFCAN))

/** Macro to check Operation Mode */
#define PARAM_MODE_TYPE(n)      ((n==CAN_OPERATING_MODE)||(n==CAN_RESET_MODE) \
                                    ||(n==CAN_LISTENONLY_MODE)||(n==CAN_SELFTEST_MODE) \
                                    ||(n==CAN_TXPRIORITY_MODE)||(n==CAN_SLEEP_MODE) \
                                    ||(n==CAN_RXPOLARITY_MODE)||(n==CAN_TEST_MODE))

/** Macro define for struct AF_Section parameter */
#define PARAM_CTRL(n)   ((n==CAN1_CTRL)|(n==CAN2_CTRL))

/** Macro define for struct AF_Section parameter */
#define PARAM_MSG_DISABLE(n)    ((n==MSG_ENABLE)|(n==MSG_DISABLE))

/**Macro to check Interrupt Type parameter */
#define PARAM_INT_EN_TYPE(n)    ((n==CANINT_RIE)||(n==CANINT_TIE1) \
                                    ||(n==CANINT_EIE)||(n==CANINT_DOIE) \
                                    ||(n==CANINT_WUIE)||(n==CANINT_EPIE) \
                                    ||(n==CANINT_ALIE)||(n==CANINT_BEIE) \
                                    ||(n==CANINT_IDIE)||(n==CANINT_TIE2) \
                                    ||(n==CANINT_TIE3)||(n==CANINT_FCE))

/** Macro to check AFLUT Entry type */
#define PARAM_AFLUT_ENTRY_TYPE(n)   ((n==FULLCAN_ENTRY)||(n==EXPLICIT_STANDARD_ENTRY)\
                                        ||(n==GROUP_STANDARD_ENTRY)||(n==EXPLICIT_EXTEND_ENTRY) \
                                        ||(n==GROUP_EXTEND_ENTRY))

/** Macro to check position */
#define PARAM_POSITION(n)   ((n>=0)&&(n<512))

/**
 * @}
 */

/* Public Types --------------------------------------------------------------- */
/** @defgroup CAN_Public_Types CAN Public Types
 * @{
 */


/***********************************************************************
 * CAN device configuration commands (IOCTL commands and arguments)
 **********************************************************************/
/** CAN peripheral ID 0 */
#define CAN_1       0

/** CAN peripheral ID 1 */
#define CAN_2       1

/**
 * @brief CAN peripheral ID no
 */
typedef enum
{
    CAN_ID_1 = CAN_1,
    CAN_ID_2 = CAN_2
} en_CAN_unitId;

/**
 * @brief CAN ID format definition
 */
typedef enum 
{
    STD_ID_FORMAT = 0,  /**< Use standard ID format (11 bit ID) */
    EXT_ID_FORMAT = 1   /**< Use extended ID format (29 bit ID) */
} CAN_ID_FORMAT_Type;

/**
 * @brief AFLUT Entry type definition
 */
typedef enum 
{
    FULLCAN_ENTRY = 0,
    EXPLICIT_STANDARD_ENTRY,
    GROUP_STANDARD_ENTRY,
    EXPLICIT_EXTEND_ENTRY,
    GROUP_EXTEND_ENTRY,
} AFLUT_ENTRY_Type;

/**
 * @brief Symbolic names for type of CAN message
 */
typedef enum 
{
    DATA_FRAME = 0,     /**< Data frame */
    REMOTE_FRAME = 1    /**< Remote frame */
} CAN_FRAME_Type;

/**
 * @brief CAN Control status definition
 */
typedef enum 
{
    CANCTRL_GLOBAL_STS = 0, /**< CAN Global Status */
    CANCTRL_INT_CAP,        /**< CAN Interrupt and Capture */
    CANCTRL_ERR_WRN,        /**< CAN Error Warning Limit */
    CANCTRL_STS             /**< CAN Control Status */
} CAN_CTRL_STS_Type;

/**
 * @brief Central CAN status type definition
 */
typedef enum 
{
    CANCR_TX_STS = 0,   /**< Central CAN Tx Status */
    CANCR_RX_STS,       /**< Central CAN Rx Status */
    CANCR_MS            /**< Central CAN Miscellaneous Status */
} CAN_CR_STS_Type;

/**
 * @brief FullCAN Interrupt Capture type definition
 */
typedef enum
{
    FULLCAN_IC0,    /**< FullCAN Interrupt and Capture 0 */
    FULLCAN_IC1 /**< FullCAN Interrupt and Capture 1 */
}FullCAN_IC_Type;

/**
 * @brief CAN interrupt enable type definition
 */
typedef enum 
{
    CANINT_RIE = 0,     /**< CAN Receiver Interrupt Enable */
    CANINT_TIE1,        /**< CAN Transmit Interrupt Enable */
    CANINT_EIE,         /**< CAN Error Warning Interrupt Enable */
    CANINT_DOIE,        /**< CAN Data Overrun Interrupt Enable */
    CANINT_WUIE,        /**< CAN Wake-Up Interrupt Enable */
    CANINT_EPIE,        /**< CAN Error Passive Interrupt Enable */
    CANINT_ALIE,        /**< CAN Arbitration Lost Interrupt Enable */
    CANINT_BEIE,        /**< CAN Bus Error Inter rupt Enable */
    CANINT_IDIE,        /**< CAN ID Ready Interrupt Enable */
    CANINT_TIE2,        /**< CAN Transmit Interrupt Enable for Buffer2 */
    CANINT_TIE3,        /**< CAN Transmit Interrupt Enable for Buffer3 */
    CANINT_FCE          /**< FullCAN Interrupt Enable */
} CAN_INT_EN_Type;

/**
 * @brief Acceptance Filter Mode type definition
 */
typedef enum 
{
    CAN_NORMAL = 0,     /**< Normal Mode */
    CAN_ACC_OFF,        /**< Acceptance Filter Off Mode */
    CAN_ACC_BP,             /**< Acceptance Fileter Bypass Mode */
    CAN_EFCAN           /**< FullCAN Mode Enhancement */
} CAN_AFMODE_Type;

/**
 * @brief CAN Mode Type definition
 */
typedef enum 
{
    CAN_OPERATING_MODE = 0,     /**< Operating Mode */
    CAN_RESET_MODE,             /**< Reset Mode */
    CAN_LISTENONLY_MODE,        /**< Listen Only Mode */
    CAN_SELFTEST_MODE,          /**< Seft Test Mode */
    CAN_TXPRIORITY_MODE,        /**< Transmit Priority Mode */
    CAN_SLEEP_MODE,             /**< Sleep Mode */
    CAN_RXPOLARITY_MODE,        /**< Receive Polarity Mode */
    CAN_TEST_MODE               /**< Test Mode */
} CAN_MODE_Type;

/**
 * @brief Error values that functions can return
 */
typedef enum 
{
    CAN_OK = 1,                 /**< No error */
    CAN_OBJECTS_FULL_ERROR,     /**< No more rx or tx objects available */
    CAN_FULL_OBJ_NOT_RCV,       /**< Full CAN object not received */
    CAN_NO_RECEIVE_DATA,        /**< No have receive data available */
    CAN_AF_ENTRY_ERROR,         /**< Entry load in AFLUT is unvalid */
    CAN_CONFLICT_ID_ERROR,      /**< Conflict ID occur */
    CAN_ENTRY_NOT_EXIT_ERROR    /**< Entry remove outo AFLUT is not exit */
} CAN_ERROR;

/**
 * @brief Pin Configuration structure
 */
typedef struct 
{
    uint8_t RD;             /**< Serial Inputs, from CAN transceivers, should be:
                             ** For CAN1:
                             - CAN_RD1_P0_0: RD pin is on P0.0
                             - CAN_RD1_P0_21 : RD pin is on P0.21
                             ** For CAN2:
                             - CAN_RD2_P0_4: RD pin is on P0.4
                             - CAN_RD2_P2_7: RD pin is on P2.7
                             */
    uint8_t TD;             /**< Serial Outputs, To CAN transceivers, should be:
                             ** For CAN1:
                             - CAN_TD1_P0_1: TD pin is on P0.1
                             - CAN_TD1_P0_22: TD pin is on P0.22
                             ** For CAN2:
                             - CAN_TD2_P0_5: TD pin is on P0.5
                             - CAN_TD2_P2_8: TD pin is on P2.8
                             */
} CAN_PinCFG_Type;

/**
 * @brief CAN message object structure
 */
typedef struct 
{
    uint32_t id;            /**< 29 bit identifier, it depend on "format" value
                                 - if format = STD_ID_FORMAT, id should be 11 bit identifier
                                 - if format = EXT_ID_FORMAT, id should be 29 bit identifier
                             */
    uint8_t dataA[4];       /**< Data field A */
    uint8_t dataB[4];       /**< Data field B */
    uint8_t len;            /**< Length of data field in bytes, should be:
                                 - 0000b-0111b: 0-7 bytes
                                 - 1xxxb: 8 bytes
                            */
    uint8_t format;         /**< Identifier Format, should be:
                                 - STD_ID_FORMAT: Standard ID - 11 bit format
                                 - EXT_ID_FORMAT: Extended ID - 29 bit format
                            */
    uint8_t type;           /**< Remote Frame transmission, should be:
                                 - DATA_FRAME: the number of data bytes called out by the DLC
                                 field are send from the CANxTDA and CANxTDB registers
                                 - REMOTE_FRAME: Remote Frame is sent
                            */
} CAN_MSG_Type;

/**
 * @brief FullCAN Entry structure
 */
typedef struct 
{
    uint8_t controller;     /**< CAN Controller, should be:
                                 - CAN1_CTRL: CAN1 Controller
                                 - CAN2_CTRL: CAN2 Controller
                            */
    uint8_t disable;        /**< Disable bit, should be:
                                 - MSG_ENABLE: disable bit = 0
                                 - MSG_DISABLE: disable bit = 1
                            */
    uint16_t id_11;         /**< Standard ID, should be 11-bit value */
} FullCAN_Entry;

/**
 * @brief Standard ID Frame Format Entry structure
 */
typedef struct 
{
    uint8_t controller;     /**< CAN Controller, should be:
                                 - CAN1_CTRL: CAN1 Controller
                                 - CAN2_CTRL: CAN2 Controller
                            */
    uint8_t disable;        /**< Disable bit, should be:
                                 - MSG_ENABLE: disable bit = 0
                                 - MSG_DISABLE: disable bit = 1
                            */
    uint16_t id_11;         /**< Standard ID, should be 11-bit value */
} SFF_Entry;

/**
 * @brief Group of Standard ID Frame Format Entry structure
 */
typedef struct 
{
    uint8_t controller1;    /**< First CAN Controller, should be:
                                 - CAN1_CTRL: CAN1 Controller
                                 - CAN2_CTRL: CAN2 Controller
                            */
    uint8_t disable1;       /**< First Disable bit, should be:
                                 - MSG_ENABLE: disable bit = 0)
                                 - MSG_DISABLE: disable bit = 1
                            */
    uint16_t lowerID;       /**< ID lower bound, should be 11-bit value */
    uint8_t controller2;    /**< Second CAN Controller, should be:
                                 - CAN1_CTRL: CAN1 Controller
                                 - CAN2_CTRL: CAN2 Controller
                            */
    uint8_t disable2;       /**< Second Disable bit, should be:
                                 - MSG_ENABLE: disable bit = 0
                                 - MSG_DISABLE: disable bit = 1
                            */
    uint16_t upperID;       /**< ID upper bound, should be 11-bit value and
                                 equal or greater than lowerID
                            */
} SFF_GPR_Entry;

/**
 * @brief Extended ID Frame Format Entry structure
 */
typedef struct 
{
    uint8_t controller;     /**< CAN Controller, should be:
                                 - CAN1_CTRL: CAN1 Controller
                                 - CAN2_CTRL: CAN2 Controller
                            */
    uint32_t ID_29;         /**< Extend ID, shoud be 29-bit value */
} EFF_Entry;


/**
 * @brief Group of Extended ID Frame Format Entry structure
 */
typedef struct 
{
    uint8_t controller1;    /**< First CAN Controller, should be:
                                 - CAN1_CTRL: CAN1 Controller
                                 - CAN2_CTRL: CAN2 Controller
                            */
    uint8_t controller2;    /**< Second Disable bit, should be:
                                 - MSG_ENABLE: disable bit = 0(default)
                                 - MSG_DISABLE: disable bit = 1
                            */
    uint32_t lowerEID;      /**< Extended ID lower bound, should be 29-bit value */
    uint32_t upperEID;      /**< Extended ID upper bound, should be 29-bit value */
} EFF_GPR_Entry;


/**
 * @brief Acceptance Filter Section Table structure
 */
typedef struct 
{
    FullCAN_Entry* FullCAN_Sec;     /**< The pointer point to FullCAN_Entry */
    uint8_t FC_NumEntry;            /**< FullCAN Entry Number */
    SFF_Entry* SFF_Sec;             /**< The pointer point to SFF_Entry */
    uint8_t SFF_NumEntry;           /**< Standard ID Entry Number */
    SFF_GPR_Entry* SFF_GPR_Sec;     /**< The pointer point to SFF_GPR_Entry */
    uint8_t SFF_GPR_NumEntry;       /**< Group Standard ID Entry Number */
    EFF_Entry* EFF_Sec;             /**< The pointer point to EFF_Entry */
    uint8_t EFF_NumEntry;           /**< Extended ID Entry Number */
    EFF_GPR_Entry* EFF_GPR_Sec;     /**< The pointer point to EFF_GPR_Entry */
    uint8_t EFF_GPR_NumEntry;       /**< Group Extended ID Entry Number */
} AF_SectionDef;

/**
 * @}
 */


/* Public Functions ----------------------------------------------------------- */
/** @defgroup CAN_Public_Functions CAN Public Functions
 * @{
 */

/* Init/DeInit CAN peripheral -----------*/
void CAN_Init(uint8_t canId, uint32_t baudrate);
void CAN_DeInit(uint8_t canId);

