RT-Thread/rt-thread/bsp/nxp/lpc/lpc408x/Libraries/Drivers/include/lpc_can.h
/* CAN messages functions ---------------*/
Status CAN_SendMsg(uint8_t canId, CAN_MSG_Type *CAN_Msg);
Status CAN_ReceiveMsg(uint8_t canId, CAN_MSG_Type *CAN_Msg);
CAN_ERROR FCAN_ReadObj(CAN_MSG_Type *CAN_Msg);

/* CAN configure functions ---------------*/
void CAN_ModeConfig(uint8_t canId, CAN_MODE_Type mode,
                                                FunctionalState NewState);
void CAN_SetAFMode(CAN_AFMODE_Type AFmode);
void CAN_SetCommand(uint8_t canId, uint32_t CMRType);

/* AFLUT functions ---------------------- */
CAN_ERROR CAN_SetupAFLUT(AF_SectionDef* AFSection);
CAN_ERROR CAN_LoadFullCANEntry(uint8_t canId, uint16_t ID);
CAN_ERROR CAN_LoadExplicitEntry(uint8_t canId, uint32_t ID,
                                                    CAN_ID_FORMAT_Type format);
CAN_ERROR CAN_LoadGroupEntry(uint8_t canId, uint32_t lowerID,
                                        uint32_t upperID, CAN_ID_FORMAT_Type format);
CAN_ERROR CAN_RemoveEntry(AFLUT_ENTRY_Type EntryType, uint16_t position);

/* CAN interrupt functions -----------------*/
void CAN_IRQCmd(uint8_t canId, CAN_INT_EN_Type arg, FunctionalState NewState);
uint32_t CAN_IntGetStatus(uint8_t canId);

/* CAN get status functions ----------------*/
IntStatus CAN_FullCANIntGetStatus (void);
uint32_t CAN_FullCANPendGetStatus (FullCAN_IC_Type type);
uint32_t CAN_GetCTRLStatus(uint8_t canId, CAN_CTRL_STS_Type arg);
uint32_t CAN_GetCRStatus(CAN_CR_STS_Type arg);

/**
 * @}
 */


#ifdef __cplusplus
}
#endif

#endif /* LPC_CAN_H_ */

/**
 * @}
 */

/* --------------------------------- End Of File ------------------------------ */
